Update uml.md
